#### Terraform Format and Style 🖌`success ✅`
#### Terraform Workspace `dev` 🤖 `success ✅`
#### Terraform Plan 📖 `success ✅`
<details><summary>Show Plan 🔎 </summary>

```diff
aws_iam_role_policy.github_actions_iac_policy: Refreshing state... [id=github-actions-iac-role:github-actions-iac-policy]
aws_iam_openid_connect_provider.github_actions_oidc: Refreshing state... [id=arn:aws:iam::808625618156:oidc-provider/token.actions.githubusercontent.com]
aws_iam_role.github_actions_iac_role: Refreshing state... [id=github-actions-iac-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+  + create
-  - destroy

Terraform will perform the following actions:

  # aws_iam_openid_connect_provider.github_actions_oidc will be destroyed
  # (because aws_iam_openid_connect_provider.github_actions_oidc is not in configuration)
-  - resource "aws_iam_openid_connect_provider" "github_actions_oidc" {
-      - arn             = "arn:aws:iam::808625618156:oidc-provider/token.actions.githubusercontent.com" -> null
-      - client_id_list  = [
-          - "sts.amazonaws.com",
        ] -> null
-      - id              = "arn:aws:iam::808625618156:oidc-provider/token.actions.githubusercontent.com" -> null
-      - tags_all        = {
-          - "Environment" = "dev"
-          - "Managed"     = "DevOps"
-          - "Terraform"   = "true"
        } -> null
-      - thumbprint_list = [
-          - "d89e3bd43d5d909b47a18977aa9d5ce36cee184c",
        ] -> null
-      - url             = "token.actions.githubusercontent.com" -> null
    }

  # aws_iam_role.github_actions_iac_role will be destroyed
  # (because aws_iam_role.github_actions_iac_role is not in configuration)
-  - resource "aws_iam_role" "github_actions_iac_role" {
-      - arn                   = "arn:aws:iam::808625618156:role/github-actions-iac-role" -> null
-      - assume_role_policy    = jsonencode(
            {
-              - Statement = [
-                  - {
-                      - Action    = "sts:AssumeRoleWithWebIdentity"
-                      - Condition = {
-                          - StringEquals = {
-                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
-                              - "token.actions.githubusercontent.com:sub" = [
-                                  - "repo:davidlimacardoso/infra-core-terraform:ref:refs/heads/main",
-                                  - "repo:davidlimacardoso/infra-core-terraform:ref:refs/heads/stage",
-                                  - "repo:davidlimacardoso/infra-core-terraform:ref:refs/heads/developer",
-                                  - "repo:davidlimacardoso/infra-core-terraform:pull_request",
                                ]
                            }
                        }
-                      - Effect    = "Allow"
-                      - Principal = {
-                          - Federated = "arn:aws:iam::808625618156:oidc-provider/token.actions.githubusercontent.com"
                        }
-                      - Sid       = ""
                    },
                ]
-              - Version   = "2012-10-17"
            }
        ) -> null
-      - create_date           = "2025-02-17T16:12:56Z" -> null
-      - force_detach_policies = false -> null
-      - id                    = "github-actions-iac-role" -> null
-      - managed_policy_arns   = [] -> null
-      - max_session_duration  = 3600 -> null
-      - name                  = "github-actions-iac-role" -> null
-      - path                  = "/" -> null
-      - tags_all              = {
-          - "Environment" = "dev"
-          - "Managed"     = "DevOps"
-          - "Terraform"   = "true"
        } -> null
-      - unique_id             = "AROA3YROXXTWLOAJMXB4S" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy.github_actions_iac_policy will be destroyed
  # (because aws_iam_role_policy.github_actions_iac_policy is not in configuration)
-  - resource "aws_iam_role_policy" "github_actions_iac_policy" {
-      - id          = "github-actions-iac-role:github-actions-iac-policy" -> null
-      - name        = "github-actions-iac-policy" -> null
-      - policy      = jsonencode(
            {
-              - Statement = [
-                  - {
-                      - Action   = [
-                          - "*",
                        ]
-                      - Effect   = "Allow"
-                      - Resource = "*"
                    },
                ]
-              - Version   = "2012-10-17"
            }
        ) -> null
-      - role        = "github-actions-iac-role" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket.this will be created
+  + resource "aws_s3_bucket" "this" {
+      + acceleration_status         = (known after apply)
+      + acl                         = (known after apply)
+      + arn                         = (known after apply)
+      + bucket                      = (known after apply)
+      + bucket_domain_name          = (known after apply)
+      + bucket_prefix               = (known after apply)
+      + bucket_regional_domain_name = (known after apply)
+      + force_destroy               = false
+      + hosted_zone_id              = (known after apply)
+      + id                          = (known after apply)
+      + object_lock_enabled         = (known after apply)
+      + policy                      = (known after apply)
+      + region                      = (known after apply)
+      + request_payer               = (known after apply)
+      + tags                        = {
+          + "Project" = "tf-test-cd"
        }
+      + tags_all                    = {
+          + "Environment" = "dev"
+          + "Managed"     = "DevOps"
+          + "Project"     = "tf-test-cd"
+          + "Terraform"   = "true"
        }
+      + website_domain              = (known after apply)
+      + website_endpoint            = (known after apply)

+      + cors_rule (known after apply)

+      + grant (known after apply)

+      + lifecycle_rule (known after apply)

+      + logging (known after apply)

+      + object_lock_configuration (known after apply)

+      + replication_configuration (known after apply)

+      + server_side_encryption_configuration (known after apply)

+      + versioning (known after apply)

+      + website (known after apply)
    }

  # aws_sns_topic.this will be created
+  + resource "aws_sns_topic" "this" {
+      + arn                         = (known after apply)
+      + beginning_archive_time      = (known after apply)
+      + content_based_deduplication = false
+      + fifo_topic                  = false
+      + id                          = (known after apply)
+      + name                        = "dev-user-updates-topic"
+      + name_prefix                 = (known after apply)
+      + owner                       = (known after apply)
+      + policy                      = (known after apply)
+      + signature_version           = (known after apply)
+      + tags_all                    = {
+          + "Environment" = "dev"
+          + "Managed"     = "DevOps"
+          + "Terraform"   = "true"
        }
+      + tracing_config              = (known after apply)
    }

  # null_resource.check_match_workspace_environment will be created
+  + resource "null_resource" "check_match_workspace_environment" {
+      + id = (known after apply)
    }

  # null_resource.validate_workspace will be created
+  + resource "null_resource" "validate_workspace" {
+      + id = (known after apply)
    }

  # random_string.bucket_suffix will be created
+  + resource "random_string" "bucket_suffix" {
+      + id          = (known after apply)
+      + length      = 5
+      + lower       = true
+      + min_lower   = 0
+      + min_numeric = 0
+      + min_special = 0
+      + min_upper   = 0
+      + number      = true
+      + numeric     = true
+      + result      = (known after apply)
+      + special     = false
+      + upper       = false
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Changes to Outputs:
+  + bucket_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

```

</details>



*Pusher: @davidlimacardoso, Action: `pull_request`*